
## Plan Result (prod)




<pre><code>Plan: 1 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * module.postgresql.terraform_data.trigger_password_reset
* Update
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;USER&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret_standard_format["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-07-04T09:11:53Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-DATABASE/53ff1e924e0b4200b50162004688156d"
        name                    = "orchestrator-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-07-04T09:11:53Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-HOST/a10b3c0f7f114e75af47cef7b6d66b9a"
        name                    = "orchestrator-POSTGRES-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-07-04T09:11:53Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-PASS/29c1660a68af4746a6d2e07bb569189a"
        name                    = "orchestrator-POSTGRES-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-07-04T09:11:53Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-PORT/5806b425b5bb488b990ad9fc65440c7b"
        name                    = "orchestrator-POSTGRES-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-07-04T09:11:53Z" -> (known after apply)
        id                      = "https://bulk-scan-prod.vault.azure.net/secrets/orchestrator-POSTGRES-USER/dc18b750a5c64d70ae946f1d7ce9e59c"
        name                    = "orchestrator-POSTGRES-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/bulk-scan-orchestrator.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "orchestrator PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # module.postgresql.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

Plan: 1 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2658,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->